---
kind: method
id: M:Autodesk.Revit.DB.RenderNode.Dispose
source: html/8ee082fe-ab92-67e6-f2bd-b285d419a005.htm
---
# Autodesk.Revit.DB.RenderNode.Dispose Method

Releases all resources used by the RenderNode

## Syntax (C#)
```csharp
public void Dispose()
```